Тест1/src/InformationRegisters/ПоказателиАвтомобилей/ПоказателиАвтомобилей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиАвтомобилей</name>
  <resources>
    <name>Рентабельность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыручкаОплаченная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Прибыль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыручкаПотенциальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест1/src/AccumulationRegisters/ИнформацияОПродажах/ИнформацияОПродажах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИнформацияОПродажах</name>
  <resources>
    <name>колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест1/src/Documents/ПоступлениеЗапчастей/ПоступлениеЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеЗапчастей</name>
  <basedOn>Document.ЗаявкаНаРасход</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ДобавлениеЗапчастей</registerRecords>
  <registerRecords>InformationRegister.дт_НоменклатураПоставщиков</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВТранзитнойЗоне</registerRecords>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>InformationRegister.дт_ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>NetZadka</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Новые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНакладной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчетФактура</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставшик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеРасчетов</name>
    <type>
      <types>EnumRef.СостоянияВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаСборку</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.дт_СостоянияПоступленияЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладТранзитный</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Перекуп</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Конвейер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Колво</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>CatalogRef.Стеллаж</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоступления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>CatalogRef.Коофициенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоступления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоставщика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/CommonModules/дт_Продажи/Module.bsl
#Область ПрограммныйИнтерфейс
// Выполняет движения регистра накопления РегистрНакопления1
//
Процедура ОтразитьДвижения(ПараметрыПроведения, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ПараметрыПроведения.ТаблицаПродажи;
	Если Отказ
	 ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	ДвиженияНабор = Движения.Продажи;
	ДвиженияНабор.Записывать = Истина;
	ДвиженияНабор.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Готовит к записи наборы записей документа (только по регистрам, входящих в подсистему)
//
Процедура ПодготовитьНаборыЗаписей(СтруктураОбъект) Экспорт
	
	РегистрыПодсистемы = Новый Массив;
	РегистрыПодсистемы.Добавить("Продажи");
	
	Для каждого Регистр Из РегистрыПодсистемы Цикл
	
		НаборЗаписей = СтруктураОбъект.Движения.Найти(Регистр);
		
		Если НаборЗаписей <> Неопределено Тогда
			Если НЕ НаборЗаписей.ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
				
			КонецЕсли;
			
			Если НЕ НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
				
				НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", СтруктураОбъект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы);
				
			КонецЕсли;
			
			//РегистрыНакопления[Регистр].СоздатьПустуюВременнуюТаблицуИзменение(СтруктураОбъект.ДополнительныеСвойства);
		
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры


// Заполняет регистр сведений ПоказателиАвтомобилей
Процедура дт_РасчетПоказателейАвтомобилей() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоказателиАвтомобилей.Автомобиль КАК Автомобиль,
		|	ПоказателиАвтомобилей.Рентабельность КАК Рентабельность,
		|	ПоказателиАвтомобилей.ВыручкаОплаченная КАК ВыручкаОплаченная,
		|	ПоказателиАвтомобилей.Прибыль КАК Прибыль,
		|	ПоказателиАвтомобилей.ВыручкаПотенциальная КАК ВыручкаПотенциальная
		|ПОМЕСТИТЬ ВТ_Показатели
		|ИЗ
		|	РегистрСведений.ПоказателиАвтомобилей КАК ПоказателиАвтомобилей
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаланПоНакладнойОбороты.Измерение1 КАК ДокументПродажи,
		|	БаланПоНакладнойОбороты.СуммаОборот КАК Сумма
		|ПОМЕСТИТЬ ВТ_Оплаты
		|ИЗ
		|	РегистрНакопления.БаланПоНакладной.Обороты(, , , ) КАК БаланПоНакладнойОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатыПоСделкамОбороты.Документ,
		|	ОплатыПоСделкамОбороты.СуммаОборот
		|ИЗ
		|	РегистрНакопления.ОплатыПоСделкам.Обороты(, , , ) КАК ОплатыПоСделкамОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Оплаты.ДокументПродажи КАК ДокументПродажи,
		|	СУММА(ВТ_Оплаты.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ОплатыГр
		|ИЗ
		|	ВТ_Оплаты КАК ВТ_Оплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Оплаты.ДокументПродажи
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Оплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОплатыГр.ДокументПродажи КАК ДокументПродажи,
		|	ВТ_ОплатыГр.Сумма КАК СуммаОплачено,
		|	ВЫБОР
		|		КОГДА ПродажаЗапчастей.ИтогоРекв = 0
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(ВТ_ОплатыГр.Сумма, 0) >= ПродажаЗапчастей.ИтогоРекв
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Коэффициент
		|ПОМЕСТИТЬ ВТ_ОплатыКоэф
		|ИЗ
		|	ВТ_ОплатыГр КАК ВТ_ОплатыГр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
		|		ПО ВТ_ОплатыГр.ДокументПродажи = ПродажаЗапчастей.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОплатыГр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнформацияОПродажахОбороты.машина КАК Автомобиль,
		|	ИнформацияОПродажахОбороты.Регистратор КАК ДокументПродажи,
		|	ИнформацияОПродажахОбороты.колвоОборот * ИнформацияОПродажахОбороты.цена КАК СуммаВыручка
		|ПОМЕСТИТЬ ВТ_Продажи
		|ИЗ
		|	РегистрНакопления.ИнформацияОПродажах.Обороты(, , Регистратор, ) КАК ИнформацияОПродажахОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОбороты.Автомобиль,
		|	ПродажиОбороты.Регистратор,
		|	ПродажиОбороты.СуммаОборот
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Продажи.Автомобиль КАК Автомобиль,
		|	ВТ_Продажи.ДокументПродажи КАК ДокументПродажи,
		|	СУММА(ВТ_Продажи.СуммаВыручка) КАК СуммаВыручка
		|ПОМЕСТИТЬ ВТ_ПродажиГр
		|ИЗ
		|	ВТ_Продажи КАК ВТ_Продажи
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Продажи.Автомобиль,
		|	ВТ_Продажи.ДокументПродажи
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Продажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистрНакопления1Остатки.машина КАК Автомобиль,
		|	РегистрНакопления1Остатки.Товар.РекомендованаяЦена * ПоступлениеЗапчастейТаблица.Наценка.Коофициент * РегистрНакопления1Остатки.КолвоОстаток КАК СуммаПродажи
		|ПОМЕСТИТЬ ВТ_ПродажиПотенциальные
		|ИЗ
		|	РегистрНакопления.РегистрНакопления1.Остатки({(&КонецПериода)}, ) КАК РегистрНакопления1Остатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеЗапчастей.Таблица КАК ПоступлениеЗапчастейТаблица
		|		ПО РегистрНакопления1Остатки.Товар = ПоступлениеЗапчастейТаблица.Товар
		|			И РегистрНакопления1Остатки.машина = ПоступлениеЗапчастейТаблица.Ссылка.Машина
		|			И РегистрНакопления1Остатки.индкод.Наименование = ПоступлениеЗапчастейТаблица.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиРасчетныеДетально.Автомобиль КАК Автомобиль,
		|	СУММА(ПоказателиРасчетныеДетально.СуммаВыручка) КАК СуммаВыручка,
		|	СУММА(ПоказателиРасчетныеДетально.СуммаВыручкаОплаченная) КАК СуммаВыручкаОплаченная,
		|	СУММА(ПоказателиРасчетныеДетально.СуммаВыручкаПотенциальная) КАК СуммаВыручкаПотенциальная
		|ПОМЕСТИТЬ ВТ_ПоказателиРасчетные
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Продажи.Автомобиль КАК Автомобиль,
		|		ВТ_Продажи.СуммаВыручка КАК СуммаВыручка,
		|		ВТ_Продажи.СуммаВыручка * ЕСТЬNULL(ВТ_ОплатыКоэф.Коэффициент, 0) КАК СуммаВыручкаОплаченная,
		|		0 КАК СуммаВыручкаПотенциальная
		|	ИЗ
		|		ВТ_ПродажиГр КАК ВТ_Продажи
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОплатыКоэф КАК ВТ_ОплатыКоэф
		|			ПО ВТ_Продажи.ДокументПродажи = ВТ_ОплатыКоэф.ДокументПродажи
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ПродажиПотенциальные.Автомобиль,
		|		0,
		|		0,
		|		ВТ_ПродажиПотенциальные.СуммаПродажи
		|	ИЗ
		|		ВТ_ПродажиПотенциальные КАК ВТ_ПродажиПотенциальные) КАК ПоказателиРасчетныеДетально
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиРасчетныеДетально.Автомобиль
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоказателиРасчетные.Автомобиль КАК Автомобиль,
		|	ВТ_ПоказателиРасчетные.СуммаВыручкаОплаченная КАК ВыручкаОплаченная,
		|	ВТ_ПоказателиРасчетные.СуммаВыручкаОплаченная - Машины.Сумма КАК Прибыль,
		|	ВЫБОР
		|		КОГДА Машины.Сумма = 0
		|			ТОГДА 0
		//Волков ИО 02.02.24 ++
		// --
		//|		ИНАЧЕ ВЫРАЗИТЬ((ВТ_ПоказателиРасчетные.СуммаВыручкаОплаченная / Машины.Сумма - 1) * 100 КАК ЧИСЛО(10, 2))
		// ++	
		|		ИНАЧЕ ВЫРАЗИТЬ((ВТ_ПоказателиРасчетные.Прибыль / Машины.Сумма) * 100 КАК ЧИСЛО(10, 2))
		//Волков ИО 02.02.24 --
		|	КОНЕЦ КАК Рентабельность,
		|	ВТ_ПоказателиРасчетные.СуммаВыручкаПотенциальная КАК ВыручкаПотенциальная
		|ИЗ
		|	ВТ_ПоказателиРасчетные КАК ВТ_ПоказателиРасчетные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Машины КАК Машины
		|		ПО ВТ_ПоказателиРасчетные.Автомобиль = Машины.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Показатели КАК ВТ_Показатели
		|		ПО ВТ_ПоказателиРасчетные.Автомобиль = ВТ_Показатели.Автомобиль
		|ГДЕ
		|	(ВТ_Показатели.Автомобиль ЕСТЬ NULL
		|			ИЛИ ВТ_Показатели.Рентабельность <> ВЫБОР
		|				КОГДА Машины.Сумма = 0
		|					ТОГДА 0
		//Волков ИО 02.02.24 ++
		|			ИНАЧЕ ВЫРАЗИТЬ((ВТ_ПоказателиРасчетные.Прибыль / Машины.Сумма) * 100 КАК ЧИСЛО(10, 2))
		//Волков ИО 02.02.24 --
		|			КОНЕЦ 
		//Волков ИО 02.02.24 --
		|			ИЛИ ВТ_Показатели.Прибыль <> ВТ_ПоказателиРасчетные.СуммаВыручкаОплаченная - Машины.Сумма
		|			ИЛИ ВТ_Показатели.ВыручкаОплаченная <> ВТ_ПоказателиРасчетные.СуммаВыручкаОплаченная
		|			ИЛИ ВТ_Показатели.ВыручкаПотенциальная <> ВТ_ПоказателиРасчетные.СуммаВыручкаПотенциальная)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Запись = РегистрыСведений.ПоказателиАвтомобилей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		
		Попытка
		
			Запись.Записать(Истина);	
		
		Исключение
			ТекстСообщения = СтрШаблон("Не удалось записать показатели автомобиля %1. %2",
					ВыборкаДетальныеЗаписи.Автомобиль,
					ОписаниеОшибки()
			);
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
